## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.synapse_workspace.azurerm_role_assignment.synapse_storage_contrib will be created
  + resource "azurerm_role_assignment" "synapse_storage_contrib" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/52c2f634-4765-4411-92ac-08cdb532a0d1/resourceGroups/Synapse-demo/providers/Microsoft.Storage/storageAccounts/synapsetest1298tf"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.synapse_workspace.azurerm_synapse_workspace.this will be created
  + resource "azurerm_synapse_workspace" "this" {
      + azuread_authentication_only          = false
      + connectivity_endpoints               = (known after apply)
      + id                                   = (known after apply)
      + location                             = "germanywestcentral"
      + managed_resource_group_name          = (known after apply)
      + name                                 = "synapsews1298tf"
      + public_network_access_enabled        = true
      + resource_group_name                  = "Synapse-demo"
      + sql_administrator_login              = "synapseadmin"
      + sql_administrator_login_password     = (sensitive value)
      + storage_data_lake_gen2_filesystem_id = "https://synapsetest1298tf.dfs.core.windows.net/raw-bronze"
      + tags                                 = {
          + "environment" = "dev"
          + "workload"    = "data-platform"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>